app/Controllers/detalhes.php

    public function index($id_sugestao)
    {
        if(!session()->has('usuario')){
            return redirect()->to($GLOBALS['baseurl']);
        }
        $sugestao = $this->db->table('sugestao')->getWhere([ 'id'=>$id_sugestao ])->getRowArray();
---
SELECT *
FROM `sugestao`
WHERE `id` = '13'