app/Controllers/perfil.php

UPDATE `usuario` SET `nome` = 'Pedro', `sobrenome` = 'Henrique', `email` = 'pedro@pedro.com'
---
    public function altera()
    {
        $tabela = $this->db->table("usuario");
        $nome = $_POST['nome'];
        $sobrenome = $_POST['sobrenome'];
        $email = $_POST['email'];
        $r =  $tabela->update(
            [
            'nome' => $nome,
            'sobrenome' => $sobrenome,
            'email' => $email,
            ]
        );