app/Controllers/site.php

SELECT *
FROM `sugestao`
ORDER BY `id` DESC
---
    public function index()
    {
        if(!session()->has('usuario')){
            return redirect()->to($GLOBALS['baseurl']);
        }
        $sugestoes = $this->db->table('sugestao')->orderBy('id', 'desc')->get()->getResultArray();