app/Controllers/sugira.php

SELECT *
FROM `usuario`
WHERE `email` = 'pedro@pedro.com'
AND `senha` = 'db560d834a8acf5a8f34505e4e0d913d'
INSERT INTO `sugestao` (`id_usuario`, `nome_usuario`, `nome`, `areamelhora`, `sugestao`) VALUES ('1', 'Pedro', 'kkkkk', 'ensino', 'gggggg')
---
    public function sugere()
    {
        $tabela = $this->db->table('sugestao');
        $titulo = $_POST['nomesugestao'];
        $areamelhora = $_POST['areamelhora'];
        $sugestao = $_POST['sugestao'];
        $nomeCriador = session()->get('usuario')['nome'];
        $usuario = $this->db->table('usuario')->getWhere([ 'email' => session()->get('usuario')['email'], 'senha' => session()->get('usuario')['senha'] ])->getRowArray();
        $idcriador = $usuario['id'];
        $r = $tabela->insert([
            'id_usuario'=>$idcriador,
            'nome_usuario'=>$nomeCriador,
            'nome'=>$titulo,
            'areamelhora'=>$areamelhora,
            'sugestao'=>$sugestao,
        ]);